
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 0 to change, 7 to destroy.</code></pre>

* Replace
  * azurerm_key_vault_secret.appInsights-InstrumentationKey
  * module.fis-app-vault.azurerm_key_vault.kv
  * module.fis-app-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.fis-app-vault.azurerm_key_vault_access_policy.developer[0]
  * module.fis-app-vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.fis-app-vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.fis-app-vault.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.appInsights-InstrumentationKey must be replaced
-/+ resource "azurerm_key_vault_secret" "appInsights-InstrumentationKey" {
      ~ id           = "https://fis-aat.vault.azure.net/secrets/AppInsightsInstrumentationKey/2a4bc2e2bd5149448979e80adda829a3" -> (known after apply)
      ~ key_vault_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> (known after apply)
        name         = "AppInsightsInstrumentationKey"
      - tags         = {} -> null
        value        = (sensitive value)
      ~ version      = "2a4bc2e2bd5149448979e80adda829a3" -> (known after apply)
    }

  # module.fis-app-vault.azurerm_key_vault.kv must be replaced
-/+ resource "azurerm_key_vault" "kv" {
      ~ access_policy                   = [
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                  - "Release",
                  - "Rotate",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                ]
              - object_id               = "60f3ab17-d512-450f-84c1-dad49796460b"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = "fe0865ed-1521-442a-a848-729ee65773ea"
              - certificate_permissions = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                  - "Purge",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                  - "Release",
                  - "Rotate",
                  - "GetRotationPolicy",
                  - "SetRotationPolicy",
                ]
              - object_id               = "42d7a307-45ac-4d09-b7c6-4195a8d3a87e"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "d9f385f1-a7ba-4ab5-97e2-d2b5b6d1dc89"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Create",
                  - "Delete",
                  - "DeleteIssuers",
                  - "Get",
                  - "GetIssuers",
                  - "Import",
                  - "List",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "Update",
                  - "ManageContacts",
                  - "ManageIssuers",
                ]
              - key_permissions         = [
                  - "Create",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Update",
                  - "Import",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Sign",
                  - "Verify",
                ]
              - object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
              - secret_permissions      = [
                  - "Set",
                  - "List",
                  - "Get",
                  - "Delete",
                  - "Recover",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "Get",
                  - "List",
                ]
              - key_permissions         = [
                  - "Get",
                  - "List",
                ]
              - object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - application_id          = ""
              - certificate_permissions = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "ManageContacts",
                  - "ManageIssuers",
                  - "GetIssuers",
                  - "ListIssuers",
                  - "SetIssuers",
                  - "DeleteIssuers",
                ]
              - key_permissions         = [
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                ]
              - object_id               = "22e66b72-e6ae-4b3a-a239-b0384287911b"
              - secret_permissions      = [
                  - "List",
                  - "Set",
                  - "Delete",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ] -> (known after apply)
      - enable_rbac_authorization       = false -> null
        enabled_for_deployment          = true
        enabled_for_disk_encryption     = true
        enabled_for_template_deployment = true
      ~ id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> (known after apply)
        location                        = "uksouth"
      ~ name                            = "fis-aat" -> "fis-kv-aat"
        purge_protection_enabled        = true
        resource_group_name             = "fis-aat"
        sku_name                        = "standard"
      ~ soft_delete_enabled             = true -> (known after apply)
        soft_delete_retention_days      = 90
        tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/fis-shared-infrastructure.git"
            "Team Contact"        = "#family-integration-cicd-notice"
            "application"         = "family-integration-systems"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#family-integration-devs"
            "environment"         = "staging"
            "managedBy"           = "Family Integration Stream"
        }
        tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      ~ vault_uri                       = "https://fis-aat.vault.azure.net/" -> (known after apply)

      ~ network_acls {
            bypass                     = "AzureServices"
            default_action             = "Allow"
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # module.fis-app-vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        certificate_permissions = [
            "Create",
            "Delete",
            "DeleteIssuers",
            "Get",
            "GetIssuers",
            "Import",
            "List",
            "ListIssuers",
            "SetIssuers",
            "Update",
            "ManageContacts",
            "ManageIssuers",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31" -> (known after apply)
        key_permissions         = [
            "Create",
            "List",
            "Get",
            "Delete",
            "Update",
            "Import",
            "Backup",
            "Restore",
            "Decrypt",
            "Encrypt",
            "UnwrapKey",
            "WrapKey",
            "Sign",
            "Verify",
        ]
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> (known after apply)
        object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
        secret_permissions      = [
            "Set",
            "List",
            "Get",
            "Delete",
            "Recover",
            "Purge",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fis-app-vault.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
        certificate_permissions = [
            "Get",
            "List",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
        key_permissions         = [
            "Get",
            "List",
        ]
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> (known after apply)
        object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
        secret_permissions      = [
            "Get",
            "List",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fis-app-vault.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
        certificate_permissions = [
            "Get",
            "List",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat/objectId/d9f385f1-a7ba-4ab5-97e2-d2b5b6d1dc89" -> (known after apply)
        key_permissions         = [
            "Get",
            "List",
        ]
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> (known after apply)
        object_id               = "d9f385f1-a7ba-4ab5-97e2-d2b5b6d1dc89"
        secret_permissions      = [
            "Get",
            "List",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fis-app-vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
        certificate_permissions = [
            "List",
            "Update",
            "Create",
            "Import",
            "Delete",
            "ManageContacts",
            "ManageIssuers",
            "GetIssuers",
            "ListIssuers",
            "SetIssuers",
            "DeleteIssuers",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat/objectId/22e66b72-e6ae-4b3a-a239-b0384287911b" -> (known after apply)
        key_permissions         = [
            "List",
            "Update",
            "Create",
            "Import",
            "Delete",
        ]
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> (known after apply)
        object_id               = "22e66b72-e6ae-4b3a-a239-b0384287911b"
        secret_permissions      = [
            "List",
            "Set",
            "Delete",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.fis-app-vault.azurerm_monitor_diagnostic_setting.kv-ds must be replaced
-/+ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      ~ id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat|fis-aat" -> (known after apply)
        log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      ~ name                       = "fis-aat" -> "fis-kv-aat"
      ~ target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fis-aat/providers/Microsoft.KeyVault/vaults/fis-aat" -> (known after apply)

        log {
            category = "AuditEvent"
            enabled  = true

            retention_policy {
                days    = 14
                enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

Plan: 7 to add, 0 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":7,"Program":"tfcmt","SHA1":"","Vars":{}} -->